Revit 2024 API
ParameterTypeId.StructuralAttachmentTopReferencedend Property
 "Top Attachment Referenced End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralAttachmentTopReferencedend { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAttachmentTopReferencedend As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAttachmentTopReferencedend {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace